![](./image/pandas-logo.png)

# Python Pandas: Tips & Tricks

## \#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

### Import Modules

In [250]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [251]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  7  6  1  2
1  6  2  4  9  1
2  8  7  8  4  8
3  6  3  5  1  8
4  9  8  8  3  2

In [252]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

### Menyertakan Prefix Kolom

In [253]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        2        7        6        1        2
1        6        2        4        9        1
2        8        7        8        4        8
3        6        3        5        1        8
4        9        8        8        3        2

### Menyertakan Suffix Kolom

In [254]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        2        7        6        1        2
1        6        2        4        9        1
2        8        7        8        4        8
3        6        3        5        1        8
4        9        8        8        3        2

## \#02: Pemilihan baris (rows selection) pada Data Frame

### Import Modules

In [255]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [256]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  3  1  1  4
1  2  2  3  2  4
2  4  3  2  4  3
3  2  3  4  2  1
4  1  4  1  2  1
5  1  2  4  2  1
6  3  2  2  3  3
7  1  1  2  3  3
8  3  3  2  4  1
9  3  4  2  2  4

### Selection dengan operator logika `|`

In [257]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
4  1  4  1  2  1
5  1  2  4  2  1
6  3  2  2  3  3
7  1  1  2  3  3
8  3  3  2  4  1
9  3  4  2  2  4

### Selection dengan fungsi `isin()`

In [258]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
4  1  4  1  2  1
5  1  2  4  2  1
6  3  2  2  3  3
7  1  1  2  3  3
8  3  3  2  4  1
9  3  4  2  2  4

### Mengenal operator negasi `~`

In [259]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  3  1  1  4
1  2  2  3  2  4
2  4  3  2  4  3
3  2  3  4  2  1

## \#03: Konversi tipe data String ke Numerik pada kolom Data Frame

### Import Modules

In [260]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [261]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [262]:
df.dtypes

col1    object
col2    object
dtype: object

### Konversi tipe data dengan fungsi `astype()`

In [263]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [264]:
df_x.dtypes

col1    object
col2     int32
dtype: object

### Konversi tipe data numerik dengan fungsi `to_numeric()`

In [265]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## \#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

### Import Modules

In [266]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [267]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         10.0         15    A
1 2000-01-01 01:00:00         10.0         10    B
2 2000-01-01 02:00:00          8.0          8    C
3 2000-01-01 03:00:00         18.0          2    D
4 2000-01-01 04:00:00         15.0         17    E

In [268]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

### Memilih kolom bertipe data numerik

In [269]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         10.0         15
1         10.0         10
2          8.0          8
3         18.0          2
4         15.0         17

In [270]:
df.select_dtypes(include='float')

   bil_pecahan
0         10.0
1         10.0
2          8.0
3         18.0
4         15.0

In [271]:
df.select_dtypes(include='int')

   bil_bulat
0         15
1         10
2          8
3          2
4         17

### Memilih kolom bertipe data string atau `object`

In [272]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

### Memilih kolom bertipe data `datetime`

In [273]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

### Memilih kolom dengan kombinasi tipe data

In [274]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         10.0         15    A
1         10.0         10    B
2          8.0          8    C
3         18.0          2    D
4         15.0         17    E

## \#05: Membalik urutan baris dan kolom pada Data Frame

### Import Modules

In [275]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [276]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  9  9  4  7
1  4  9  7  9  4
2  1  7  9  5  5
3  8  3  5  3  8
4  3  1  7  6  4

### Membalik urutan kolom

In [277]:
df.loc[:, ::-1]

   E  D  C  B  A
0  7  4  9  9  8
1  4  9  7  9  4
2  5  5  9  7  1
3  8  3  5  3  8
4  4  6  7  1  3

### Membalik urutan baris

In [278]:
df.loc[::-1]

   A  B  C  D  E
4  3  1  7  6  4
3  8  3  5  3  8
2  1  7  9  5  5
1  4  9  7  9  4
0  8  9  9  4  7

### Membalik urutan baris dan melakukan penyesuaian ulang `index`

In [279]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  1  7  6  4
1  8  3  5  3  8
2  1  7  9  5  5
3  4  9  7  9  4
4  8  9  9  4  7

## \#06: Mengganti nama (label) kolom pada Data Frame

### Import Modules

In [280]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [281]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  4  7  7  3
1  1  3  6  3  9
2  9  8  6  4  4
3  3  7  6  6  7
4  8  8  5  4  1

### Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [282]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  7  4     7  7  3
1  1  3     6  3  9
2  9  8     6  4  4
3  3  7     6  6  7
4  8  8     5  4  1

### Mengganti nama (label) untuk banyak kolom pada Data Frame

In [283]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       4  7     7  3
1     1       3  6     3  9
2     9       8  6     4  4
3     3       7  6     6  7
4     8       8  5     4  1

## \#07: Menghapus (drop) missing values (`NaN`)

### Import Modules

In [284]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [285]:
df = pd.util.testing.makeMissingDataframe().reset_index() 
df.head()

        index         A         B         C         D
0  mDaGqVARGU  0.510561 -0.640966 -0.693434 -2.022415
1  4jPQpOwR3S  0.690172 -0.261829 -0.357834  0.473222
2  Qd9WuLdVgk -0.012491 -0.182932  0.725175       NaN
3  8dEkaosVSl -0.901160 -0.485518 -1.785392       NaN
4  apC34F4ZP4 -2.305725 -0.179614 -0.603959  0.277244

In [286]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  mDaGqVARGU  0.510561 -0.640966 -0.693434 -2.022415
1  4jPQpOwR3S  0.690172 -0.261829 -0.357834  0.473222
2  Qd9WuLdVgk -0.012491 -0.182932  0.725175       NaN
3  8dEkaosVSl -0.901160 -0.485518 -1.785392       NaN
4  apC34F4ZP4 -2.305725 -0.179614 -0.603959  0.277244

In [287]:
# Mengcopy data
df_backup = df.copy(deep=True)

### Menghapus (drop) setiap kolom yang mengandung missing values

In [288]:
df = df.dropna(axis='columns') 
df.head()

            Z
0  mDaGqVARGU
1  4jPQpOwR3S
2  Qd9WuLdVgk
3  8dEkaosVSl
4  apC34F4ZP4

### Menghapus (drop) setiap baris yang mengandung missing values

In [289]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  mDaGqVARGU  0.510561 -0.640966 -0.693434 -2.022415
1  4jPQpOwR3S  0.690172 -0.261829 -0.357834  0.473222
4  apC34F4ZP4 -2.305725 -0.179614 -0.603959  0.277244
5  vhq0wLJbhE  1.386436  0.431188 -0.454870  0.576239
8  qOiC7Cm1FK  1.998068 -0.013143  0.811385 -0.178021

### Persentase missing values untuk tiap kolom

In [290]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.100000
B    0.100000
C    0.133333
D    0.066667
dtype: float64

### Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [291]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         B         D
0  mDaGqVARGU  0.510561 -0.640966 -2.022415
1  4jPQpOwR3S  0.690172 -0.261829  0.473222
2  Qd9WuLdVgk -0.012491 -0.182932       NaN
3  8dEkaosVSl -0.901160 -0.485518       NaN
4  apC34F4ZP4 -2.305725 -0.179614  0.277244

## \#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

### Import Modules

In [292]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [293]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

### Mengenal Pandas Series

In [294]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [295]:
type(df['A'])

pandas.core.series.Series

In [296]:
type(df)

pandas.core.frame.DataFrame

### Memeriksa kesamaan dengan operator `==`

In [297]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

### Memeriksa kesamaan dengan method `equals()`

In [298]:
df['A'].equals(df['B'])

True

### Memeriksa kesamaan antar dua Data Frame

In [299]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [300]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## \#09: Membagi Data Frame menjadi dua secara acak

### Import Modules

In [301]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [358]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  16   5  13  11   1
1   8  19  12   4   4
2   7  12   4   1  11
3  10  19  19   6   9
4  12   5   9  12  14
5   7  19  18   6  12
6   3   8  11   7  17
7  13  13  15   8  17
8  18   1  10  18   3
9  19   7  13   1  19

### Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [359]:
df.shape

(10, 5)

In [360]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [361]:
df_1

    A   B   C   D   E
4  12   5   9  12  14
7  13  13  15   8  17
5   7  19  18   6  12
6   3   8  11   7  17
1   8  19  12   4   4
3  10  19  19   6   9
0  16   5  13  11   1

In [362]:
df_2

    A   B   C   D   E
2   7  12   4   1  11
8  18   1  10  18   3
9  19   7  13   1  19

## \#10: Mengganti nama (label) kolom pada Data Frame berdasarkan pola

### Import Modules

In [363]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [364]:
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan `_`

In [365]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex__,__age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Memangkas kelebihan spasi pada nama kolom

In [366]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## \#11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan `loc`

### Import Modules

In [311]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [312]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18   4   1  12  16
1   4   4  18   9   5
2  16   2  18   6   5
3  14   4  16  16   4
4  17   5   5   5  16
5   2  18  10   2  16
6   9   2   4  10  17
7  14   9  19  19   1
8   8   9   8  17   1
9  14  16   6  10   5

### Seleksi kolom dan baris menggunakan `loc`

In [313]:
df.loc[[0,3,4], ['B','E']]

   B   E
0  4  16
3  4   4
4  5  16

### Seleksi baris dengan kondisi

In [314]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
5  18   2  16
9  16  10   5

### Slicing Data Frame dengan `loc`

In [315]:
df.loc[0:4, 'B':'D']

   B   C   D
0  4   1  12
1  4  18   9
2  2  18   6
3  4  16  16
4  5   5   5

## \#12: Membentuk kolom bertipe `datetime` dari sejumlah kolom lain pada Data Frame

### Import Modules

In [316]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [317]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

### Membentuk kolom bertipe `datetime`

In [318]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [319]:
df.dtypes

day                    int64
month                  int64
year                   int64
penaggalan    datetime64[ns]
dtype: object

## \#13: Konversi nilai numerik ke dalam sejumlah kategori

### Import Modules

In [320]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [321]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    57
1    33
2    83
3    80
4    82
5    22
6    16
7    90
8    47
9    86

### Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan `cut()`

In [322]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    57        dewasa
1    33        dewasa
2    83        manula
3    80        manula
4    82        manula
5    22        dewasa
6    16          anak
7    90        manula
8    47        dewasa
9    86        manula

## \#14: Menggabungkan (merge) dua Data Frame

### Import Modules

In [323]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [324]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   6   2  14  17  10
1  13   6  18  17  10
2   8  15   7   2   3
3  14   7   4   6   2
4   9  13  15  10  13

In [325]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0   6   2  14  17  10
2   8  15   7   2   3
3  14   7   4   6   2

In [326]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1  13   6  18  17  10
2   8  15   7   2   3
4   9  13  15  10  13

### Menggabungkan dua Data Frame

In [327]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

   A   B  C  D  E
0  8  15  7  2  3

In [328]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   6   2  14  17  10
1   8  15   7   2   3
2  14   7   4   6   2
3  13   6  18  17  10
4   9  13  15  10  13

## \#15: Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

### Import Modules

In [329]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [330]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

### Memecah nama depan dan nama belakang

In [331]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

### Memecah nama kota dan propinsi

In [332]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## \#16: Menata ulang Data Frame dengan mutiple indexes menggunakan `unstack()`

### Import Modules

In [333]:
import pandas as pd

print(pd.__version__)

1.3.5

### Persiapan Data Frame

In [334]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Data Frame dengan multiple indexes dari hasil groupping

In [335]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

### Menata ulang Data Frame dengan mutiple indexes

In [336]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

## \#17: Resampling pada data deret waktu (time series data)

### Import Modules

In [337]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [338]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00    17    19
2000-01-01 01:00:00     4    15
2000-01-01 02:00:00     6    14
2000-01-01 03:00:00    12     9
2000-01-01 04:00:00     9    12
...                   ...   ...
2000-12-30 19:00:00     7    19
2000-12-30 20:00:00     2    16
2000-12-30 21:00:00    13     2
2000-12-30 22:00:00    14     9
2000-12-30 23:00:00    18     1

[8760 rows x 2 columns]

### Resampling data dengan interval monthly

In [339]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7453
2000-02-29  7016
2000-03-31  7588
2000-04-30  7090
2000-05-31  7232
2000-06-30  7110
2000-07-31  7502
2000-08-31  7403
2000-09-30  7059
2000-10-31  7263
2000-11-30  7179
2000-12-31  7470

### Resampling data dengan interval daily

In [340]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   225
2000-01-02   274
2000-01-03   261
2000-01-04   235
2000-01-05   216
...          ...
2000-12-26   252
2000-12-27   270
2000-12-28   244
2000-12-29   275
2000-12-30   272

[365 rows x 1 columns]

## \#18: Membentuk dummy Data Frame

### Import Modules

In [341]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Membentuk Data Frame dari Dictionary

In [342]:
pd.DataFrame({'col1':[1, 2, 3, 4], 
              'col2':[5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

### Membentuk Data Frame dari Numpy Array

In [343]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[ 2,  8, 13],
       [15,  8,  3],
       [13,  5, 17],
       [17,  6, 14],
       [ 5,  7,  9]])

In [344]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A  B   C
0   2  8  13
1  15  8   3
2  13  5  17
3  17  6  14
4   5  7   9

### Membentuk Data Frame dengan memanfaatkan  `pandas.util.testing`

In [345]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
7NXmudcvUx -1.416365  0.479600  0.243134  0.764830
uEf5bFf1Fw -0.138115  0.170771 -0.087739  0.873815
d8XzvUSYin  0.734188  0.059547 -0.217663  0.126652
FjMJiFTfhP -0.858818 -0.837326  0.652247 -0.409920
cqPbl08dIF  0.895669 -0.007954  1.229055  0.404056

In [346]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [347]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.304509 -0.013242 -0.959850 -0.393115
2000-01-04  0.055904  0.357824  0.661971 -0.754127
2000-01-05 -1.215429 -0.186361  2.578042  1.237359
2000-01-06  1.139051  0.428356 -0.025768  0.324728
2000-01-07  0.815290  1.482240 -1.460414 -0.176163

In [348]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
8I14DMrnax  0.800633  0.916743 -0.253078 -0.792711
RySkgWn0vf -1.750583  0.837121  0.299942 -0.931413
AwIo56gczI -0.435490  0.046756 -1.013678 -0.541708
7rAVgktt3w  0.570781       NaN -1.277800  0.888981
YJQgZ1FQQD  0.094349  0.340276 -0.677417 -0.878740

## \#19: Formatting tampilan Data Frame

### Import Modules

In [349]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.5
1.21.4

### Persiapan Data Frame

In [350]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

   omset  operasional
0      5           11
1      3            7
2     16            4
3     17            7
4      7           15

In [351]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   500000       110000
1   300000        70000
2  1600000        40000
3  1700000        70000
4   700000       150000

In [352]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   500000       110000
1 2000-01-02   300000        70000
2 2000-01-03  1600000        40000
3 2000-01-04  1700000        70000
4 2000-01-05   700000       150000

### Melakukan formatting tampilan Data Frame

In [353]:
formatku = {'tanggal':'{:%d/%m/%y}', 
            'operasional':'Rp {:.2f}',
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

ImportError: Missing optional dependency 'Jinja2'. DataFrame.style requires jinja2. Use pip or conda to install Jinja2.

In [ ]:
type(laporan)

In [ ]:
laporan.hide_index()

In [ ]:
laporan.set_caption('Data Omset dan Operasional')

In [ ]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

## \#20: Menggabungkan (merge) dua Data Frame secara berdampingan

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d1 = {'col1':[1, 2, 3], 
      'col2':[10, 20, 30]}
df1 = pd.DataFrame(d1)
df1

In [ ]:
d2 = {'col3':[4, 5, 6], 
      'col4':[40, 50, 60]}
df2 = pd.DataFrame(d2)
df2

### Menggabungkan (merge) dua Data Frame secara berdampingan

In [ ]:
df = pd.merge(df1, df2, left_index=True, right_index=True)
df

## \#21: Melakukan agregasi menggunakan `agg()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/Iris.csv')
df

### Mengenal `groupby()` dan fungsi agregasi

In [ ]:
df.groupby('Species')['PetalLengthCm'].count().to_frame()

In [ ]:
df.groupby('Species')['PetalLengthCm'].mean().to_frame()

In [ ]:
df.groupby('Species')['PetalLengthCm'].median().to_frame()

### Agregasi dengan `agg()`

In [ ]:
df.groupby('Species')['PetalLengthCm'].agg(['count', 'mean', 'median'])

### Agregasi dengan `describe()`

In [ ]:
df.groupby('Species')['PetalLengthCm'].describe()

## \#22: Memantau penggunaan memory suatu Data Frame

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df_titanic = pd.read_csv('./data/titanicfull.csv')
df_titanic.head()

In [ ]:
df_iris = pd.read_csv('./data/Iris.csv')
df_iris.head()

### Memantau penggunaan memory suatu Data Frame

In [ ]:
df_titanic.info(memory_usage='deep')

In [ ]:
df_iris.info(memory_usage='deep')

### Memantau penggunaan memory untuk setiap kolom dari suatu Data Frame

In [ ]:
df_titanic.memory_usage(deep=True)

In [ ]:
df_iris.memory_usage(deep=True)

## \#23: Seleksi baris pada Data Frame dengan `query()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

### Seleksi baris dengan `query()`

In [ ]:
df.query('kolom_satu > 2')

In [ ]:
df.query('`kolom dua` > 30')

## \#24: UTC dan konversi zona waktu (time zone) pada Python Pandas

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Series

In [ ]:
s = pd.Series(range(1591683521, 1592201921, 3600))
s = pd.to_datetime(s, unit='s')
s.head()

[Unix Epoch Time](https://en.wikipedia.org/wiki/Unix_time) <br/>
[Epoch Time Converter](https://www.epochconverter.com/)

### Pengaturan zona waktu (time zone)

In [ ]:
s = s.dt.tz_localize('UTC')
s.head()

In [ ]:
s = s.dt.tz_convert('Asia/Jakarta')
s.head()

In [ ]:
s = s.dt.tz_convert('Australia/Hobart')
s.head()

## \#25: Pengaturan tampilan (display option) pada Python Pandas

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df

### Pengaturan tampilan

In [ ]:
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 6)
pd.set_option('display.max_colwidth', 20)

df

In [ ]:
pd.reset_option('^display.', silent=True)

df

In [ ]:
pd.describe_option()

## \#26: Membuat Data Frame dari hasil seleksi Spreadsheet

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Membuat Data Frame dari hasil seleksi Spreadsheet

In [ ]:
df = pd.read_clipboard()
df

## \#27: Mengenal fungsi agregasi `first()` dan `last()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'dokter':['Budi', 'Wati', 'Iwan', 'Budi', 'Budi', 'Wati'], 
     'pasien':['Abdul', 'Rahmat', 'Asep', 'Joko', 'Wiwin', 'Lisa']}

df = pd.DataFrame(d)
df

### Mengenal fungsi agregasi `first()` dan `last()`

In [ ]:
df.groupby('dokter')['pasien'].count().to_frame()

In [ ]:
df.groupby('dokter')['pasien'].first().to_frame()

In [ ]:
df.groupby('dokter')['pasien'].last().to_frame()

## \#28: Mengenal `explode` dan `implode` list pada Data Frame

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'Team':['DC', 'Marvel'], 
     'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'], 
               ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

### Explode

In [ ]:
df1 = df.explode('Heroes')
df1

### Implode

In [ ]:
d = {'Team':['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

In [ ]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

## \#29: Melakukan random sampling pada Data Frame

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'col_1':[1, 2, 3, 4, 5], 
     'col_2':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

### Random sampling with/without replacement

In [ ]:
df.sample(n=4, replace=False, random_state=0)

In [ ]:
df.sample(n=4, replace=True, random_state=0)

## \#30: Akses nilai variabel pada `query()`

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

### Akses nilai variabel pada `query()`

In [ ]:
df.query('A > 10')

In [ ]:
rerata = df['A'].mean()
rerata

In [ ]:
df.query('A > @rerata')

## \#31: Mengenal tipe data ordinal pada Pandas

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'pelanggan':[11, 12, 13, 14], 
     'kepuasan':['baik', 'cukup', 'buruk', 'cukup']}

df = pd.DataFrame(d)
df

### Tipe data ordinal pada Pandas

In [ ]:
from pandas.api.types import CategoricalDtype

tingkat_kepuasan = CategoricalDtype(['buruk', 'cukup', 'baik', 'sangat baik'], 
                                    ordered=True)

df['kepuasan'] = df['kepuasan'].astype(tingkat_kepuasan)
df

In [ ]:
df = df.sort_values('kepuasan', ascending=True)
df

In [ ]:
df[df['kepuasan'] >= 'cukup']

## \#32: Plotting dari suatu Pandas Data Frame

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
n_rows = 40
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df.head()

### Line Plot

In [ ]:
df.head()

In [ ]:
df.plot(kind='line')

In [ ]:
df[['A', 'B']].plot(kind='line')

### Bar Plot

In [ ]:
df.head()

In [ ]:
df.plot(kind='bar')

In [ ]:
df[['A', 'B']].plot(kind='bar')

In [ ]:
df[['A', 'B']].head().plot(kind='bar')

In [ ]:
df[['A', 'B']].head().plot(kind='barh')

### Area Plot

In [ ]:
df.head()

In [ ]:
df.plot(kind='area')

In [ ]:
df[['A', 'B']].head().plot(kind='area')

### Box Plot

In [ ]:
df.head()

In [ ]:
df.plot(kind='box')

### Histogram

In [ ]:
df.head()

In [ ]:
df.plot(kind='hist')

In [ ]:
df[['A', 'B']].plot(kind='hist')

### Kernel Density Estimation (KDE)

In [ ]:
df.head()

In [ ]:
df.plot(kind='kde')

### Scatter Plot

In [ ]:
df.head()

In [ ]:
df.plot(x='A', y='B', kind='scatter')

## \#33: Menampilkan nilai kumulatif (cummulative)

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'pemain':['Budi', 'Joni', 'Iwan', 'Budi', 'Budi', 'Iwan', 'Asep', 'Joni'], 
     'goal':[2, 1, 3, 1, 1, 2, 2, 3]}
df = pd.DataFrame(d)
df

### Menampilkan nilai kumulatif (cummulative)

In [ ]:
df['goal'].cumsum().to_frame()

In [ ]:
df['jumlah_goal_kumulatif'] = df['goal'].cumsum()
df

In [ ]:
df['jumlah_goal_kumulatif_tiap_pemain'] = df.groupby('pemain')['goal'].cumsum()
df

In [ ]:
df['cummax'] = df['goal'].cummax()
df

In [ ]:
df['cummin'] = df['goal'].cummin()
df

In [ ]:
df['cumprod'] = df['goal'].cumprod()
df

## \#34: Mapping pada Data Frame dengan `applymap()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.DataFrame({'jenis_kelamin':['Pria', 'Wanita', 'lelaki', 'Lelaki', 'perempuan'], 
                   'usia':[23, 21, 24, 22, 21], 
                   'shift':['pagi', 'siang', 'Malam', 'Siang', 'pagi']})
df

### Mapping pada Data Frame dengan `applymap()`

In [ ]:
df = df.applymap(lambda x: x.lower() if type(x) == str else x)
df

### `applymap()` dengan dictionary

In [ ]:
mapping = {'pria':'L',
           'lelaki':'L',
           'wanita':'P',
           'perempuan':'P',
           'pagi':1,
           'siang':2,
           'malam':3}

df.applymap(mapping.get)

In [ ]:
df[['jenis_kelamin', 'shift']] = df[['jenis_kelamin', 'shift']].applymap(mapping.get)

df

## \#35: Memadukan fungsi agregasi dengan `transform()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'no_nota':[1, 1, 1, 2, 2, 3, 4, 5], 
     'kopi': ['latte', 'cappuccino', 'espresso', 'latte', 'espresso', 'cappuccino', 'latte', 'espresso'],
     'harga':[50, 60, 80, 150, 120, 60, 100, 40]}

df = pd.DataFrame(d)
df

### Menghitung total harga untuk tiap nomor nota

In [ ]:
df.groupby('no_nota')['harga'].sum().to_frame()

In [ ]:
df['total_harga'] = df.groupby('no_nota')['harga'].transform(sum)
df

### Menghitung total omset untuk tiap jenis kopi yang terjual

In [ ]:
df.groupby('kopi')['harga'].sum().to_frame()

In [ ]:
df['total_omset'] = df.groupby('kopi')['harga'].transform(sum)
df

## \#36: Menyatukan kolom dengan `str.cat()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
        'jenis_kelamin': ['L', 'L', 'P', 'L'], 
        'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

### Menyatukan kolom dengan `str.cat()`

In [ ]:
df['nama'].str.cat(df['jenis_kelamin'], sep=', ').to_frame()

In [ ]:
df['nama_jk'] = df['nama'].str.cat(df['jenis_kelamin'], sep=', ')
df

In [ ]:
df['nama'].str.cat(df['usia'].astype('str'), sep=' - ').to_frame()

In [ ]:
df['nama_usia'] = df['nama'].str.cat(df['usia'].astype('str'), sep=' - ')
df

## \#37: Seleksi baris dengan banyak kriteria

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

### Seleksi baris dengan banyak kriteria

In [ ]:
df[(df['sex']=='female') & (df['age']>=60) & (df['embarked']=='S') & (df['survived']==1)]

In [ ]:
df[
    (df['sex']=='female') & 
    (df['age']>=60) & 
    (df['embarked']=='S') & 
    (df['survived']==1)
]

In [ ]:
kr1 = df['sex']=='female'
kr2 = df['age']>=60
kr3 = df['embarked']=='S'
kr4 = df['survived']==1

df[kr1 & kr2 & kr3 & kr4]

## \#38: Mengenal parameter `header` dan `skiprows`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/iris_error.csv')
df.head(8)

In [ ]:
df = pd.read_csv('./data/iris_error.csv', header=2, skiprows=[5,6])
df.head()

## \#39: Mengacak urutan baris pada DataFrame

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
n_rows = 6
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

### Mengacak urutan baris pada DataFrame

In [ ]:
df.sample(frac=1.0, random_state=1)

In [ ]:
df.sample(frac=1.0, random_state=1).reset_index(drop=True)

## \#40: Mengakses sekelompok data dengan `get_group()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

### Mengakses sekelompok data yang sudah terkelompok dengan `get_group()`

In [ ]:
grouped_df = df.groupby('sex')

In [ ]:
grouped_df.get_group('female').head(10)

In [ ]:
grouped_df = df.groupby('survived')

In [ ]:
grouped_df.get_group(1).head(10)

## \#41: Menerapkan agregasi pada sejumlah kolom dengan `agg()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

 ### Menerapkan agregasi pada sejumlah kolom dengan `agg()`

In [ ]:
df.groupby('pclass').agg({'pclass':'count', 
                          'age':['mean', 'max'], 
                          'survived': 'mean'})

In [ ]:
df.groupby('pclass').agg(n_pass=('pclass', 'count'),
                         avg_age=('age', 'mean'),
                         max_age=('age', 'max'), 
                         survival_rate=('survived', 'mean'))

## \#42: Mengurutkan data berdasarkan kolom tertentu

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

### Mengurutkan data berdasarkan kolom tertentu

In [ ]:
df.sort_values('age').head()

In [ ]:
df.sort_values('age', ascending=False).head()

In [ ]:
df.sort_values(['survived', 'age']).head()

## \#43: Menangani whitespace pada Data Frame

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
data = {'nim': ['10', '11', '12', '13', '  '],
        'nama': ['adi', '  ', 'tejo', '  ', 'bejo']}

df = pd.DataFrame(data)
df

### Menangani whitespace pada Data Frame

In [ ]:
df

In [ ]:
df.info()

In [ ]:
df = df.replace(r'^\s*$', np.nan, regex=True)
df

In [ ]:
df.info()

## \#44: Menata ulang penempatan kolom pada Data Frame

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

### Menata ulang penempatan kolom pada Data Frame

In [ ]:
df[['D', 'C', 'A', 'E', 'B']]

In [ ]:
df

In [ ]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

## \#45: Memadukan `loc` dan `iloc` untuk melakukan seleksi data

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

### Memadukan `loc` dan `iloc` untuk melakukan seleksi data

In [ ]:
df.iloc[15:20, :].loc[:, 'name':'age']

In [ ]:
df.loc[:, 'name':'age'].iloc[15:20, :]

## \#46: Seleksi weekdays dan weekends pada data deret waktu (time series)

### Import Modules

In [ ]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

### Persiapan Data Frame

In [ ]:
n_rows = 365
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df

### Seleksi weekdays dan weekends

In [ ]:
weekdays_df = df[df.index.dayofweek.isin([0, 1, 2, 3, 4])]
weekdays_df.head(7)

In [ ]:
weekends_df = df[df.index.dayofweek.isin([5, 6])]
weekends_df.head(7)

## \#47: Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'nama':['bejo', 'tejo', 'wati', 'tiwi', 'cecep'], 
     'ipk':[2, '3', 3, 2.75, '3.25']}
df = pd.DataFrame(d)
df

### Deteksi dan penanganan kolom dengan tipe data beragam (mixed data types)

In [ ]:
df.dtypes

In [ ]:
df['ipk'].apply(type)

In [ ]:
df['ipk'].apply(type).value_counts()

In [ ]:
df['ipk'] = df['ipk'].astype(float)

In [ ]:
df['ipk'].apply(type).value_counts()

## \#48: Mengenal Cummulative Count dengan `cumcount()`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

### Mengenal Cummulative Count dengan `cumcount()`

In [ ]:
df['count_tiap_penjual'] = df.groupby('penjual').cumcount() + 1
df

In [ ]:
df['count_tiap_barang'] = df.groupby('barang').cumcount() + 1
df

In [ ]:
df['count_pasangan_kolom'] = df.groupby(['penjual', 'barang']).cumcount() + 1
df

## \#49: Seleksi kolom dengan `f-string`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

### Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/Iris.csv')
df.head()

### Seleksi kolom dengan `f-string`

In [ ]:
df['SepalWidthCm'].to_frame().head()

In [ ]:
part = 'Sepal'

df[f'{part}WidthCm'].to_frame().head()

In [ ]:
df[['PetalWidthCm', 'PetalLengthCm']].head()

In [ ]:
part = 'Petal'

df[[f'{part}WidthCm', f'{part}LengthCm']].head()

## \#50: Membuat kolom baru dengan `looping` dan `f-string`

### Import Modules

In [ ]:
import pandas as pd

print(pd.__version__)

1.0.5

### Persiapan Data Frame

In [ ]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

### Membuat kolom baru dengan `for loop` dan `f-string`

In [ ]:
cols = ['penjual', 'barang']

for col in cols:
    df[f'count_tiap_{col}'] =  df.groupby(col).cumcount() + 1
    
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4